// Напишіть функцію, яка приймає як параметри два числа та рядок operator(+,-,/,*).
//  Поверніть результат операції.
//  За допомогою if-else зробіть перевірки на корректність передаваємих даних та викидайте помилку(throw new Error() ), якщо дані невірні:

// -Якщо операція ділення("/"), то другий параметр не може бути 0
// -Для всіх операцій перший та другий параметр повинні бути числами
// -Третій параметр повинен бути рядком та дорівнювати одному із 4 значень : +-/*
// -Кількість аргументів не повинна бути більше 3-х
// -Інші перевірки по бажанню